// Вывести на экран число «ПИ» с точностью до сотых.
Double Pi = Math.PI;
Console.WriteLine("Оригинальный пи");
Console.WriteLine(Pi);
Console.WriteLine("Подрезаный пи");
Console.WriteLine("{0: 0.0000}", Pi);